In [1]:
import pandas as pd
import numpy as np

In [25]:
customers = pd.read_csv("customers.csv")
orders = pd.read_csv("orders.csv")
order_items = pd.read_csv("order_items.csv")

In [ ]:
# customers["last_name"].str.strip().sort_values().head()
#orders.sort_values("order_date").tail()
# orders.sort_values("order_date", ascending = False)

     order_id  customer_id  order_date
213      5214         1075  2024-03-31
383      5384         1111  2024-03-31
215      5216         1103  2024-03-31
207      5208         1023  2024-03-30
14       5015         1019  2024-03-30
..        ...          ...         ...
430      5431         1006  2024-01-01
271      5272         1004  2024-01-01
56       5057         1019  2024-01-01
13       5014         1090  2024-01-01
246      5247         1017  2024-01-01

[450 rows x 3 columns]

In [ ]:
#ny_customers = customers[customers["city"].str.strip().str.lower().isin(["new york", "nyc"])]
#ny_customers.head()

    customer_id first_name last_name      city
0          1001       Evan     Smith  New York
3          1004      Aisha     Smith  new york
5          1006       Evan     Patel  new york
7          1008      Maria     Smith       NYC
10         1011        Ben     Davis  New York

In [13]:
recent_orders = orders[orders["order_date"] > "2024-02-14"]
recent_orders.head()

    order_id  customer_id  order_date
1       5002         1045  2024-02-20
5       5006         1031  2024-03-10
7       5008         1061  2024-03-08
9       5010         1054  2024-03-24
12      5013         1074  2024-02-16

In [14]:
big_purchases = order_items[order_items["quantity"] > 1]
big_purchases.head()

   order_id product_name  quantity  unit_price
0      5311      Monitor         3         300
1      5303     Keyboard         3          70
2      5012     Keyboard         3          70
3      5318      Monitor         3         300
6      5339    Desk Lamp         2          45

In [ ]:
customers["city"].unique()

array(['New York', 'chicago', 'Los Angeles', 'new york', 'LA', 'NYC',
       'Chicago'], dtype=object)

In [19]:
customers["city"].value_counts()

city
LA             24
New York       22
chicago        17
Los Angeles    17
new york       15
NYC            15
Chicago        10
Name: count, dtype: int64

In [28]:
city_standards = {
    'LA': 'Los Angeles',
    'NYC': 'New York'
}

customers['city'] = customers['city'].replace(city_standards)
customers['city'] = customers['city'].str.title()
customers['city'].value_counts()

city
New York       52
Los Angeles    41
Chicago        27
Name: count, dtype: int64

In [29]:
customers['last_name'].value_counts()

last_name
Davis       17
Smith       15
Chen        15
Brown       14
Patel       14
Wilson      13
Anderson    13
Lopez        8
 Smith       3
 Patel       3
 Brown       2
 Davis       2
 Chen        1
Name: count, dtype: int64

In [ ]:
# APPLY FUNCTION EXAMPLE
#technically don't need it here but for practice
customers['clean_last_name'] = customers['last_name'].apply(
    lambda last_name : # use function on every value
    last_name.strip() # strip function for each
)

In [37]:
customers["clean_last_name"].value_counts()

clean_last_name
Davis       19
Smith       18
Patel       17
Brown       16
Chen        16
Anderson    13
Wilson      13
Lopez        8
Name: count, dtype: int64

In [38]:
#another, row-wise
order_items["total_price"] = order_items["quantity"] * order_items["unit_price"]

In [40]:
# Apply called on entire dataframe - 
# Limits it with axis = 1, telling it to go row by row
order_items["total_price_apply"] = order_items.apply(
    lambda row:
    row["quantity"] * row["unit_price"], axis = 1
)

In [39]:
order_items["order_items"] = order_items.apply(
    lambda row: (
        "Large Expensive Order" if row["quantity"] >= 3 and row["unit_price"] > 50 
        else "Bulk Order" if row["quantity"] >= 3
        else "Standard Order"
    ), axis = 1
)

In [41]:
order_items

,order_id,product_name,quantity,unit_price,total_price,order_items,total_price_apply
0,5311,Monitor,3,300,900,Large Expensive Order,900
1,5303,Keyboard,3,70,210,Large Expensive Order,210
2,5012,Keyboard,3,70,210,Large Expensive Order,210
3,5318,Monitor,3,300,900,Large Expensive Order,900
4,5080,USB Cable,1,10,10,Standard Order,10
...,...,...,...,...,...,...,...
895,5303,USB Cable,2,10,20,Standard Order,20
896,5117,Monitor,2,300,600,Standard Order,600
897,5124,Keyboard,1,70,70,Standard Order,70
898,5399,USB Cable,2,10,20,Standard Order,20
899,5281,Monitor,1,300,300,Standard Order,300

**Merging Tables**

In [42]:
orders_with_customers = orders.merge(customers, how = "inner")
orders_with_customers.head()

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name
0,5001,1089,2024-01-26,Aisha,Smith,New York,Smith
1,5002,1045,2024-02-20,Priya,Davis,New York,Davis
2,5003,1004,2024-02-14,Aisha,Smith,New York,Smith
3,5004,1036,2024-02-13,Chloe,Davis,New York,Davis
4,5005,1070,2024-01-05,jordan,Brown,Los Angeles,Brown

In [44]:
orders_customers_items = orders_with_customers.merge(order_items, on = "order_id")
orders_customers_items

,order_id,customer_id,order_date,first_name,last_name,city,clean_last_name,product_name,quantity,unit_price,total_price,order_items,total_price_apply
0,5001,1089,2024-01-26,Aisha,Smith,New York,Smith,Monitor,1,300,300,Standard Order,300
1,5001,1089,2024-01-26,Aisha,Smith,New York,Smith,Desk Lamp,2,45,90,Standard Order,90
2,5001,1089,2024-01-26,Aisha,Smith,New York,Smith,Desk Lamp,1,45,45,Standard Order,45
3,5002,1045,2024-02-20,Priya,Davis,New York,Davis,Monitor,2,300,600,Standard Order,600
4,5002,1045,2024-02-20,Priya,Davis,New York,Davis,Monitor,2,300,600,Standard Order,600
...,...,...,...,...,...,...,...,...,...,...,...,...,...
895,5450,1008,2024-02-26,Maria,Smith,New York,Smith,Laptop,2,1200,2400,Standard Order,2400
896,5450,1008,2024-02-26,Maria,Smith,New York,Smith,Keyboard,3,70,210,Large Expensive Order,210
897,5450,1008,2024-02-26,Maria,Smith,New York,Smith,USB Cable,2,10,20,Standard Order,20
898,5450,1008,2024-02-26,Maria,Smith,New York,Smith,Mouse,3,25,75,Bulk Order,75
899,5450,1008,2024-02-26,Maria,Smith,New York,Smith,Monitor,2,300,600,Standard Order,600

In [45]:
order_items["total_price"].sum()

np.int64(420615)

In [47]:
order_items.groupby("product_name")["total_price"].sum().sort_values()

product_name
USB Cable      2570
Mouse          6750
Desk Lamp     10755
Keyboard      14140
Monitor       90000
Laptop       296400
Name: total_price, dtype: int64

In [49]:
order_items.groupby("product_name")["quantity"].sum().sort_values(ascending=False)

product_name
Monitor      300
Mouse        270
USB Cable    257
Laptop       247
Desk Lamp    239
Keyboard     202
Name: quantity, dtype: int64

In [51]:
order_items.groupby("product_name").agg(
    total_revenue = ("total_price", "sum"),
    avg_quantity = ("quantity", "mean")
)

              total_revenue  avg_quantity
product_name
Desk Lamp             10755      1.593333
Keyboard              14140      1.578125
Laptop               296400      1.776978
Monitor               90000      1.754386
Mouse                  6750      1.719745
USB Cable              2570      1.658065

In [53]:
#combined.groupby("customer_id")["total_price"].sum().sort_values(ascending = False).head()

**Reshaping Data**

In [ ]:
sample = combined[["customer_id", "product_name","total_price"]].head(12)

# NEED TO REVIEW FOOTAGE JUST BEFORE HALFWAY POINT

NameError: name 'combined' is not defined